Autodesk.Revit.DB.FormattedText.SetIndentLevel(Autodesk.Revit.DB.TextRange,System.Int32)
Sets the number of tab stops that the paragraph should be indented.
Remarks:
The indent level is the number of tab stops by which each paragraph will be indented.
Note that adjoining paragraphs that have the same indent level
and have a list type other than Autodesk.Revit.DB.ListType.None
are considered part of a numbered list.
Changing the indent level of paragraphs that are bulleted or numbered
(i.e. paragraphs that have a  list type other than Autodesk.Revit.DB.ListType.None)
may cause other changes to the document as the changed paragraphs
may join or leave a list.  Which will cause the other paragraphs in those lists
to be renumbered.
This function applies the nesting level to all paragraphs contained in the given range.
The level set on the paragraph cannot be negative and cannot be larger than the value returned by
Autodesk.Revit.DB.FormattedText.GetMaximumIndentLevel .
textRange:
The given text range.
level:
The level set on the paragraph.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
-or-
This level is too large to set on a paragraph.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for level is negative.
Since:
2017

Autodesk.Revit.DB.FormattedText.GetMaximumIndentLevel
Returns the maximum allowed indent level
Since:
2017

Autodesk.Revit.DB.FormattedText.GetIndentLevel(Autodesk.Revit.DB.TextRange)
Returns the indent level of the paragraphs in the text range.
Remarks:
Returns -1 if the range contains multiple paragraphs with different indent levels.
textRange:
The given text range.
Returns:
The indentation level of the paragraphs in the range.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.SetListStartNumber(Autodesk.Revit.DB.TextRange,System.Int32)
Sets the list start number on the paragraphs in a given text range.
Remarks:
List start number is the number of the first paragraph in a numbered list.
List start number can be set on paragraphs of type Autodesk.Revit.DB.ListType.ArabicNumbers,
Autodesk.Revit.DB.ListType.LowerCaseLetters and Autodesk.Revit.DB.ListType.UpperCaseLetters.
List start number can only be set for top-level paragraphs in a list;
that is, they cannot be set to paragraphs which are part of a sub-list.
For paragraphs of type Autodesk.Revit.DB.ListType.LowerCaseLetters and Autodesk.Revit.DB.ListType.UpperCaseLetters
the list start number represents the letter in the order it appears in the alphabet.
For example, for paragraphs of type Autodesk.Revit.DB.ListType.LowerCaseLetters,
list start number of 2 will result in a list start "b.";
list start number of 27 will result in a list start "aa.".
Adjoining paragraphs which have a list type other than Autodesk.Revit.DB.ListType.None
are considered part of a numbered list.
Changing the list start number of numbered paragraphs
will cause changes to the numbers of the rest of the paragraphs in the same list.
This function applies the list start number to the given range.
The list start number must be in the range given by the methods
Autodesk.Revit.DB.FormattedText.GetMinimumListStartNumber and
Autodesk.Revit.DB.FormattedText.GetMaximumListStartNumber.
textRange:
The given text range.
value:
The list start number to be set on the text range.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
-or-
This list start number is not valid.
A valid value must be in the range given by the methods
Autodesk.Revit.DB.FormattedText.GetMinimumListStartNumber and
Autodesk.Revit.DB.FormattedText.GetMaximumListStartNumber.
-or-
Cannot set list start number on this text range. The range contains paragraphs on which list start number cannot be set.
List start number can be set on pararaphs of type Autodesk.Revit.DB.ListType.ArabicNumbers,
Autodesk.Revit.DB.ListType.LowerCaseLetters and Autodesk.Revit.DB.ListType.UpperCaseLetters.
List start number can only be set for top-level paragraphs in a list;
that is, they cannot be set to paragraphs which are part of a sub-list.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.GetMinimumListStartNumber
Returns the minumum allowed list start number.
Since:
2017

Autodesk.Revit.DB.FormattedText.GetMaximumListStartNumber
Returns the maximum allowed list start number.
Since:
2017

Autodesk.Revit.DB.FormattedText.GetListStartNumber(Autodesk.Revit.DB.TextRange)
Returns the list start number of the paragraphs in a given text range.
Remarks:
Returns -1 if there is a mix of list start values in the range or
if there are paragraphs in different lists or sub-lists in the range or
if there are paragraphs of type Autodesk.Revit.DB.ListType.None or Autodesk.Revit.DB.ListType.Bullet in the range.
textRange:
The given text range.
Returns:
The list start number of the text range.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.SetListType(Autodesk.Revit.DB.TextRange,Autodesk.Revit.DB.ListType)
Sets the Autodesk.Revit.DB.ListType of a paragraph.
Remarks:
This function applies the Autodesk.Revit.DB.ListType
to all paragraphs contained in the given range.
The following Autodesk.Revit.DB.ListType options are available:
Autodesk.Revit.DB.ListType.BulletAutodesk.Revit.DB.ListType.ArabicNumbersAutodesk.Revit.DB.ListType.LowerCaseLettersAutodesk.Revit.DB.ListType.UpperCaseLetters
Set the list type to Autodesk.Revit.DB.ListType.None
if the paragraph should not be in a list.
The list type cannot be set to Autodesk.Revit.DB.ListType.Mixed.
Paragraphs with a Autodesk.Revit.DB.ListType other than Autodesk.Revit.DB.ListType.None are considered
to be 'list' paragraphs.
Consecutive list paragraphs with the same indentation level are treated as part of the same list.
A list ends when a list paragraph is followed by
a paragraph that has Autodesk.Revit.DB.ListType.Noneor a list paragraph that has a lower indentation level, (i.e. is indented less)
Note that a list will continue uninterrupted after list paragraphs that have higher indentation level.
These paragraphs are considered a 'sub-list'.
Using Autodesk.Revit.DB.FormattedText.SetIndentLevel(Autodesk.Revit.DB.TextRange,System.Int32) it is therefore possible to create multi-level lists.
Note that sub-lists can have their own sub-sub-lists.
The nesting level is only limited by the maximum indent level.
FormattedText will keep lists consistent.
That means that numbered paragraphs will automatically get sequential numbers or letters.
It also means that if the list type of one paragraphs in the list
is changed then that change is propagated to all the paragraphs in that list.
Even if those paragraphs were not in the input text range.
Note that this will not affect the list type of any nested sub-lists.
Use a vertical tab character ('\v') to insert a line without a bullet or number.
Since this does not end the paragraph this will allow the list to continue to the next paragraph.
textRange:
The given text range.
listType:
The Autodesk.Revit.DB.ListType to set on the paragraph.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
-or-
This list type is not valid to set on a paragraph.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.FormattedText.GetListType(Autodesk.Revit.DB.TextRange)
Returns the Autodesk.Revit.DB.ListType of a paragraph.
Remarks:
This function returns the list type of all paragraphs contained in the given range.
Returns Autodesk.Revit.DB.ListType.None if the paragraph is not in a list.
Returns Autodesk.Revit.DB.ListType.Mixed if the list types don't match between the paragraphs.
textRange:
The given text range.
Returns:
The Autodesk.Revit.DB.ListType of the paragraph.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.SetAllCapsStatus(System.Boolean)
Sets the characters in the entire text to be in all caps or not.
isAllCaps:
The desired all caps status of characters in the entire text.
True to set all capped, false to set not all capped.
Since:
2017

Autodesk.Revit.DB.FormattedText.SetSuperscriptStatus(System.Boolean)
Sets the characters in the entire text to be superscript or not superscript.
Remarks:
If the characters are set to be superscript, they cannot be subscript.
This sets the subscript status to false.
isSuperscript:
The desired superscript status of characters in the entire text.
True to set superscript, false to set not superscript.
Since:
2017

Autodesk.Revit.DB.FormattedText.SetSubscriptStatus(System.Boolean)
Sets the characters in the entire text to be subscript or not subscript.
Remarks:
If the characters are set to be subscript, they cannot be superscript.
This sets the superscript status to false.
isSubscript:
The desired subscript status of characters in the entire text.
True to set subscript, false to set not subscript.
Since:
2017

Autodesk.Revit.DB.FormattedText.SetUnderlineStatus(System.Boolean)
Sets the characters in the entire text to be underlined or not underlined.
isUnderlined:
The desired underline status of characters in the entire text.
True to set underlined, false to set not underlined.
Since:
2017

Autodesk.Revit.DB.FormattedText.SetItalicStatus(System.Boolean)
Sets the characters in the entire text to be italic or not italic.
isItalic:
The desired italic status of characters in the entire text.
True to set italic, false to set not italic.
Since:
2017

Autodesk.Revit.DB.FormattedText.SetBoldStatus(System.Boolean)
Sets the characters in the entire text to be bold or not bold.
isBold:
The desired bold status of characters in the entire text.
True to set bold, false to set not bold.
Since:
2017

Autodesk.Revit.DB.FormattedText.SetAllCapsStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be in all caps or not.
Remarks:
Removing the all caps status will revert the characters back to their
original case.  It will not make them lower case.
The given text range should not be empty.
textRange:
The given text range.
isAllCaps:
The desired all caps status of characters in the given text range.
True will render all characters in all caps.
False will revert the characters back to their original mixed case.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.SetSuperscriptStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be superscript or not superscript.
Remarks:
Superscript and subscript are mutually exclusive.
Applying the superscript status will automatically remove the subscript status.
The given text range should not be empty.
textRange:
The given text range.
isSuperscript:
The desired superscript status of characters in the given text range.
True to set superscript, false to set not superscript.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.SetSubscriptStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be subscript or not subscript.
Remarks:
Superscript and subscript are mutually exclusive.
Applying the subscript status will automatically remove the superscript status.
The given text range should not be empty.
textRange:
The given text range.
isSubscript:
The desired subscript status of characters in the given text range.
True to set subscript, false to set not subscript.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.SetUnderlineStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be underlined or not underlined.
Remarks:
Bullets, numbers, or letters of a list can not be underlined.
The given text range should not be empty.
textRange:
The given text range.
isUnderlined:
The desired underline status of characters in the given text range.
True to set underlined, false to set not underlined.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.SetItalicStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be italic or not italic.
Remarks:
To make the numbers or letters in a list italic, apply the italic status to
the carriage return character that ends the list paragraph.
The given text range should not be empty.
textRange:
The given text range.
isItalic:
The desired italic status of characters in the given text range.
True to set italic, false to set not italic.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.SetBoldStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be bold or not bold.
Remarks:
To make the numbers or letters in a list bold, apply the bold status to
the carriage return character that ends the list paragraph.
The given text range should not be empty.
textRange:
The given text range.
isBold:
The desired bold status of characters in the given text range.
True to set bold, false to set not bold.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.GetAllCapsStatus
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed of characters in the entire text are in all caps.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the entire text contains one character.
Returns:
The format status of all caps on characters Autodesk.Revit.DB.FormatStatus.
Since:
2017

Autodesk.Revit.DB.FormattedText.GetSuperscriptStatus
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed of characters in the entire text are superscripted.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the entire text contains one character.
Returns:
The format status of superscript on characters Autodesk.Revit.DB.FormatStatus.
Since:
2017

Autodesk.Revit.DB.FormattedText.GetSubscriptStatus
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed of characters in the entire text are subscripted.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the entire text contains one character.
Returns:
The format status of subscript on characters Autodesk.Revit.DB.FormatStatus.
Since:
2017

Autodesk.Revit.DB.FormattedText.GetUnderlineStatus
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed of characters in the entire text are underlined.
Remarks:
This function only returns All or None if the entire text contains one character.
Returns:
The format status of underline on characters Autodesk.Revit.DB.FormatStatus.
Since:
2017

Autodesk.Revit.DB.FormattedText.GetItalicStatus
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed of characters in the entire text are italic.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the entire text contains one character.
Returns:
The format status of italic on characters Autodesk.Revit.DB.FormatStatus.
Since:
2017

Autodesk.Revit.DB.FormattedText.GetBoldStatus
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed of characters in the entire text are bold.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the entire text contains one character.
Returns:
The format status of bold on characters Autodesk.Revit.DB.FormatStatus.
Since:
2017

Autodesk.Revit.DB.FormattedText.GetAllCapsStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are in all caps.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of all caps on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.GetSuperscriptStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are superscripted.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of superscript on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.GetSubscriptStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are subscripted.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of subscript on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.GetUnderlineStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are underlined.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of underline on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.GetItalicStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are italic.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of italic on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.GetBoldStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are bold.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of bold on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.SetPlainText(Autodesk.Revit.DB.TextRange,System.String)
Sets the text with the given text in a plain text form in a range.
Remarks:
Any individual formatting present in the range before will be lost after applying this function
and the text in the range will have uniform formatting.
The given text will be inserted if the given text range is empty.
The given text should have no more than 30,000 characters.
The the resulting text may not exceed 30,000 characters.
Newline characters ('\n') are not allowed.
textRange:
The given text range.
plainText:
The given text in a plain text form.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
-or-
plainText contains invalid characters such as a newline character.
-or-
plainText (excluding a carriage return character ('\r') at the end) has more than 30,000 characters.
-or-
Replacing the text in textRange with plainText will exceed 30,000 characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.SetPlainText(System.String)
Sets the entire text with the given text in a plain text form.
Remarks:
Any individual formatting present before will be lost after applying this function
and the text will have uniform formatting.
If the text does not end with a carriage return character ('\r') one will be added.
An empty string is allowed.
The given text should have no more than 30,000 characters, not counting a terminating carriage return  character ('\r').
Newline characters ('\n') are not allowed.
plainText:
The given text in a plain text form.
Throws Autodesk.Revit.Exceptions.ArgumentException:
plainText (excluding a carriage return character ('\r') at the end) has more than 30,000 characters.
-or-
plainText contains invalid characters such as a newline character.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.GetPlainText(Autodesk.Revit.DB.TextRange)
Returns a substring of the text in a plain text form. The start and end of the substring is identified
by a given Autodesk.Revit.DB.TextRange.
textRange:
The given Autodesk.Revit.DB.TextRange.
Returns:
The substring of the text in a plain text form.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.GetPlainText
Returns the entire text in a plain text form.
Remarks:
The text includes a carriage return character ('\r') that is always present.
As a result this method will never return an empty string.
Returns:
The entire text in a plain text form.
Since:
2017

Autodesk.Revit.DB.FormattedText.AsTextRange
Returns a Autodesk.Revit.DB.TextRange object that represents the entire text.
Remarks:
This range includes a carriage return character ('\r') that is always present.
As a result the range can never be an empty range.
Returns:
The Autodesk.Revit.DB.TextRange object that represents the entire text.
Since:
2017

Autodesk.Revit.DB.FormattedText.Find(System.String,System.Int32,System.Boolean,System.Boolean)
Returns a text range identifying the first occurrence of the given string within the text,
starting from a given index.
Remarks:
Returns an empty text range:
if the given string cannot be found in the text.if the given start index is beyond the length of the entire text.
The search can be case-sensitive or case-insensitive.
The search can be set to match whole words or part of words.
searchString:
The text to search for.
startIndex:
The start index to search within the text.
matchCase:
True if the case must match when searching the formatted text, false to search in a case-insensitive manner.
matchWholeWord:
True if the match must be a whole word when searching the formatted text, false otherwise.
Returns:
The text range identified.
Throws Autodesk.Revit.Exceptions.ArgumentException:
searchString is an empty string.
-or-
searchString contains invalid characters such as a newline character.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for startIndex is negative.
Since:
2017

Autodesk.Revit.DB.FormattedText.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormattedText.#ctor(System.String)
Creates a new FormattedText object with unformatted text.
Remarks:
The given text should have no more than 30,000 characters.
Line feed characters ('/n') are not allowed.
An empty string is allowed.
plainText:
The text in a plain text form.
Throws Autodesk.Revit.Exceptions.ArgumentException:
plainText (excluding a carriage return character ('\r') at the end) has more than 30,000 characters.
-or-
plainText contains invalid characters such as a newline character.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FormattedText.#ctor
Creates a new default FormattedText object, which contains only a carriage return character and has no formatting.
Since:
2017

Autodesk.Revit.DB.FormattedText
FormattedText is used to create, edit and format text in a Autodesk.Revit.DB.TextNote
or to query the text and format properties of a Autodesk.Revit.DB.TextNode
Remarks:
An instance of FormattedText can be obtained from a Autodesk.Revit.DB.TextNote
(See TextNote.GetFormattedText())
or from a Autodesk.Revit.DB.TextNode
(See TextNode.GetFormattedText())
It is also possible to create a new instance of FormattedText and assign it
to a Autodesk.Revit.DB.TextNote
(See TextNote.SetFormattedText())
This will result in a Autodesk.Revit.DB.TextNote with text with the specified formatting applied
Formatted text can be used to:
Create formatted text for a new Autodesk.Revit.DB.TextNoteEdit, Find and Replace text in an existing Autodesk.Revit.DB.TextNoteModify formatting of text in an existing Autodesk.Revit.DB.TextNoteOr query the text and formatting a Autodesk.Revit.DB.TextNote or a Autodesk.Revit.DB.TextNode
Formatted text can be populated with plain text by using its
constructor Autodesk.Revit.DB.FormattedText.#ctor(System.String) that takes a string,
or by using the Autodesk.Revit.DB.FormattedText.SetPlainText(System.String) method.
In addition, selected ranges of text can be added, removed, or replaced with the
Autodesk.Revit.DB.FormattedText.SetPlainText(Autodesk.Revit.DB.TextRange,System.String) method
by specifying a Autodesk.Revit.DB.TextRange.
Use the Autodesk.Revit.DB.FormattedText.Find(System.String,System.Int32,System.Boolean,System.Boolean) method to find the location of existing text.
Formatted text can have up to 30,000 characters.
All characters, except the linefeed character ('\n'), are allowed.
This means that you should not use the 'Environment.NewLine' property, since that includes a linefeed character.
Use the carriage return character ('\r') to terminate a paragraph.
And use a vertical tab character ('\v') to create a new line without terminating the paragraph.
Formatted text allows for individual characters to be formatted.
The following formatting can be applied.
Bold                   Italic                 Underline              Superscript/Subscript  All Caps
Use Autodesk.Revit.DB.FormattedText.SetBoldStatus(Autodesk.Revit.DB.TextRange,System.Boolean))
, Autodesk.Revit.DB.FormattedText.SetItalicStatus(Autodesk.Revit.DB.TextRange,System.Boolean))
, Autodesk.Revit.DB.FormattedText.SetUnderlineStatus(Autodesk.Revit.DB.TextRange,System.Boolean))
, Autodesk.Revit.DB.FormattedText.SetSuperscriptStatus(Autodesk.Revit.DB.TextRange,System.Boolean))
, Autodesk.Revit.DB.FormattedText.SetSubscriptStatus(Autodesk.Revit.DB.TextRange,System.Boolean))
, or Autodesk.Revit.DB.FormattedText.SetAllCapsStatus(Autodesk.Revit.DB.TextRange,System.Boolean))
to set the character formatting on a range of text.
Use Autodesk.Revit.DB.FormattedText.GetBoldStatus(Autodesk.Revit.DB.TextRange))
, Autodesk.Revit.DB.FormattedText.GetItalicStatus(Autodesk.Revit.DB.TextRange))
, Autodesk.Revit.DB.FormattedText.GetUnderlineStatus(Autodesk.Revit.DB.TextRange))
, Autodesk.Revit.DB.FormattedText.GetSuperscriptStatus(Autodesk.Revit.DB.TextRange))
, Autodesk.Revit.DB.FormattedText.GetSubscriptStatus(Autodesk.Revit.DB.TextRange))
, or Autodesk.Revit.DB.FormattedText.GetAllCapsStatus(Autodesk.Revit.DB.TextRange))
to get the character formatting of a range of text.
Text can be broken up in paragraphs.  Paragraphs are terminated by a carriage return character ('\r').
Each paragraph can be indented several levels deep.
For each additional level the indentation increments by one tab size.
The total indentation is the product of a tab size and the indent level.
Use Autodesk.Revit.DB.FormattedText.SetIndentLevel(Autodesk.Revit.DB.TextRange,System.Int32) to set the level of indenting
up to a maximum indent level that can be obtained from
Autodesk.Revit.DB.FormattedText.GetMaximumIndentLevel
Use Autodesk.Revit.DB.FormattedText.GetIndentLevel(Autodesk.Revit.DB.TextRange) to find the indent level of a given range of text.
Note that the tab size is determined by the object that will contain the FormattedText.
In the case of a Autodesk.Revit.DB.TextNote the tab size is a property of the Autodesk.Revit.DB.TextNoteType
returned from TextNote.TextNoteType.
The tab size can be found by calling the Autodesk.Revit.DB.Element.Parameter(System.Guid)
with Autodesk.Revit.DB.BuiltInParameter.TEXT_TAB_SIZE on the Autodesk.Revit.DB.TextNoteType obtained from the Autodesk.Revit.DB.TextNote
In the case of a Autodesk.Revit.DB.TextNode the tab size can be obtained from its TabSize property
Formatted text can also be used to create numbered or bulleted paragraphs with the
Autodesk.Revit.DB.FormattedText.SetListType(Autodesk.Revit.DB.TextRange,Autodesk.Revit.DB.ListType) method.
The following Autodesk.Revit.DB.ListType options are available:
Autodesk.Revit.DB.ListType.BulletAutodesk.Revit.DB.ListType.ArabicNumbersAutodesk.Revit.DB.ListType.LowerCaseLettersAutodesk.Revit.DB.ListType.UpperCaseLetters
Paragraphs with a Autodesk.Revit.DB.ListType other than Autodesk.Revit.DB.ListType.None are considered
to be 'list' paragraphs.
Consecutive list paragraphs with the same indentation level are treated as part of the same list.
A list ends when a list paragraph is followed by
a paragraph that has Autodesk.Revit.DB.ListType.Noneor a list paragraph that has a lower indentation level, i.e. is indented less.
(See Autodesk.Revit.DB.FormattedText.GetIndentLevel(Autodesk.Revit.DB.TextRange))
Note that a list will continue uninterrupted after list paragraphs that have higher indentation level.
These paragraphs form a 'sub-list' of the list they interrupt.
Sub-lists can have their own sub-sub-lists.
The nesting level is only limited by the maximum indent level.
Using Autodesk.Revit.DB.FormattedText.SetIndentLevel(Autodesk.Revit.DB.TextRange,System.Int32) it is therefore possible to create multi-level lists.
FormattedText will keep lists consistent.
That means that list paragraphs will automatically get sequential numbers or letters.
It also means that if the list type of one of the paragraphs in a list
is changed then that change is propagated to all the paragraphs in that list.
Note that this will not affect the list type of any nested sub-lists.
Use a vertical tab character ('\v') to insert a line without a bullet or number.
Since this does not end the paragraph this will allow the list to continue to the next paragraph.
Since:
2017